Repository: ysmo/brazil-checkout-fields
Catalog: languages/brazil-checkout-fields-*.po
Languages: pt_br

source: Customer type field name format is invalid. Only letters, numbers and underscores are allowed, and must start with a letter or underscore.
pt_br: Formato do nome do campo tipo de cliente é inválido. Apenas letras, números e sublinhados são permitidos, e deve começar com uma letra ou sublinhado.

source: Document field name format is invalid. Only letters, numbers and underscores are allowed, and must start with a letter or underscore.
pt_br: Formato do nome do campo documento é inválido. Apenas letras, números e sublinhados são permitidos, e deve começar com uma letra ou sublinhado.

source: Customer type values cannot be empty.
pt_br: Valores do tipo de cliente não podem estar vazios.

source: Settings saved successfully.
pt_br: Configurações salvas com sucesso.

source: Settings have been reset to default values! Cache cleared, statistics will be recalculated.
pt_br: Configurações foram redefinidas para valores padrão! Cache limpo, estatísticas serão recalculadas.

source: Brazil CPF/CNPJ Configuration
pt_br: Configuração Brazil CPF/CNPJ

source: Field Name Customization Feature
pt_br: Recurso de Personalização de Nome de Campo

source: This plugin supports custom database field names
pt_br: Este plugin suporta nomes de campos de banco de dados personalizados

source: Customer Type Field Name
pt_br: Nome do Campo Tipo de Cliente

source: Only letters, numbers and underscores are allowed, and must start with a letter or underscore
pt_br: Apenas letras, números e sublinhados são permitidos, e deve começar com uma letra ou sublinhado

source: Field name for storing customer type values
pt_br: Nome do campo para armazenar valores de tipo de cliente

source: Current effective field name:
pt_br: Nome do campo efetivo atual:

source: CPF Customer Type Value
pt_br: Valor do Tipo de Cliente CPF

source: Value saved in customer type field when user enters CPF
pt_br: Valor salvo no campo tipo de cliente quando o usuário digita CPF

source: Current value:
pt_br: Valor atual:

source: CNPJ Customer Type Value
pt_br: Valor do Tipo de Cliente CNPJ

source: Value saved in customer type field when user enters CNPJ
pt_br: Valor salvo no campo tipo de cliente quando o usuário digita CNPJ

source: Document Field Name
pt_br: Nome do Campo Documento

source: Stores formatted CPF/CNPJ numbers
pt_br: Armazena números CPF/CNPJ formatados

source: Plugin Version
pt_br: Versão do Plugin

source: Smart document detection and multilingual support for Brazil CPF/CNPJ validation plugin
pt_br: Plugin de validação Brasil CPF/CNPJ com detecção inteligente de documentos e suporte multilíngue

source: Save Settings
pt_br: Salvar Configurações

source: Reset to Defaults
pt_br: Redefinir para Padrões

source: Important Notice:
pt_br: Aviso Importante:

source: After changing field names, new orders will use the new field names to save data
pt_br: Após alterar nomes de campos, novos pedidos usarão os novos nomes de campo para salvar dados

source: Existing order data will not be automatically migrated to new field names
pt_br: Dados de pedidos existentes não serão migrados automaticamente para novos nomes de campo

source: It is recommended to test in a staging environment before using in production
pt_br: É recomendado testar em ambiente de desenvolvimento antes de usar em produção

source: Field names can only contain letters, numbers and underscores, and must start with a letter or underscore
pt_br: Nomes de campos podem conter apenas letras, números e sublinhados, e devem começar com uma letra ou sublinhado

source: Data Migration Tool
pt_br: Ferramenta de Migração de Dados

source: If you have changed field names, you can use the following tool to migrate existing order data to new fields:
pt_br: Se você alterou nomes de campos, pode usar a ferramenta seguinte para migrar dados de pedidos existentes para novos campos:

source: Migration Source Fields
pt_br: Campos de Origem da Migração

source: Customer Type Source Field:
pt_br: Campo de Origem do Tipo de Cliente:

source: Document Source Field:
pt_br: Campo de Origem do Documento:

source: Migration Target Fields
pt_br: Campos de Destino da Migração

source: Customer Type Target Field:
pt_br: Campo de Destino do Tipo de Cliente:

source: Document Target Field:
pt_br: Campo de Destino do Documento:

source: Start Data Migration
pt_br: Iniciar Migração de Dados

source: 🔄 Customer Type Value Migration Tool
pt_br: 🔄 Ferramenta de Migração de Valor de Tipo de Cliente

source: Customer Type Value Migration Feature
pt_br: Recurso de Migração de Valor de Tipo de Cliente

source: Use this tool to update existing order data when you have modified CPF or CNPJ customer type values.
pt_br: Use esta ferramenta para atualizar dados de pedidos existentes quando você modificou valores de tipo de cliente CPF ou CNPJ.

source: Use Case:
pt_br: Caso de Uso:

source: For example, when changing "pessoa_fisica" to "individual", or "pessoa_juridica" to "company".
pt_br: Por exemplo, ao alterar "pessoa_fisica" para "individual", ou "pessoa_juridica" para "company".

source: Original CPF Customer Type Value
pt_br: Valor Original do Tipo de Cliente CPF

source: Old CPF customer type value to be replaced (e.g.: pessoa_fisica)
pt_br: Valor antigo do tipo de cliente CPF a ser substituído (ex.: pessoa_fisica)

source: New CPF Customer Type Value
pt_br: Novo Valor do Tipo de Cliente CPF

source: New CPF customer type value (current configuration: %s)
pt_br: Novo valor do tipo de cliente CPF (configuração atual: %s)

source: Original CNPJ Customer Type Value
pt_br: Valor Original do Tipo de Cliente CNPJ

source: Old CNPJ customer type value to be replaced (e.g.: pessoa_juridica)
pt_br: Valor antigo do tipo de cliente CNPJ a ser substituído (ex.: pessoa_juridica)

source: New CNPJ Customer Type Value
pt_br: Novo Valor do Tipo de Cliente CNPJ

source: New CNPJ customer type value (current configuration: %s)
pt_br: Novo valor do tipo de cliente CNPJ (configuração atual: %s)

source: Migration Options
pt_br: Opções de Migração

source: Migrate all historical orders (including orders using default values)
pt_br: Migrar todos os pedidos históricos (incluindo pedidos usando valores padrão)

source: Check this to also migrate orders using default customer type values
pt_br: Marque isto para também migrar pedidos usando valores padrão de tipo de cliente

source: ⚠️ Important Notice:
pt_br: ⚠️ Aviso Importante:

source: This operation will bulk update customer type values in orders
pt_br: Esta operação irá atualizar em massa valores de tipo de cliente em pedidos

source: It is recommended to backup the database before execution
pt_br: É recomendado fazer backup do banco de dados antes da execução

source: A detailed migration report will be displayed after completion
pt_br: Um relatório detalhado de migração será exibido após a conclusão

source: If unsure, please test in a staging environment first
pt_br: Se não tiver certeza, teste em ambiente de desenvolvimento primeiro

source: 📊 Data Preview
pt_br: 📊 Visualização de Dados

source: Click the button to view current customer type value distribution in the database:
pt_br: Clique no botão para ver a distribuição atual de valores de tipo de cliente no banco de dados:

source: Preview Data
pt_br: Visualizar Dados

source: Loading...
pt_br: Carregando...

source: Unable to load data preview:
pt_br: Não foi possível carregar a visualização de dados:

source: Error occurred while loading data preview
pt_br: Erro ocorreu ao carregar visualização de dados

source: Start Customer Type Value Migration
pt_br: Iniciar Migração de Valor de Tipo de Cliente

source: 📊 Recent Order Data
pt_br: 📊 Dados de Pedidos Recentes

source: If data is not displaying correctly, you can clear cache to force reload:
pt_br: Se os dados não estiverem sendo exibidos corretamente, você pode limpar o cache para forçar o recarregamento:

source: Clear Cache
pt_br: Limpar Cache

source: 🇧🇷 Total Orders
pt_br: 🇧🇷 Total de Pedidos

source: All Brazil orders
pt_br: Todos os pedidos do Brasil

source: 👤 CPF Orders
pt_br: 👤 Pedidos CPF

source: Individual customers
pt_br: Clientes individuais

source: 🏢 CNPJ Orders
pt_br: 🏢 Pedidos CNPJ

source: Business customers
pt_br: Clientes empresariais

source: ⚙️ Current Field
pt_br: ⚙️ Campo Atual

source: 🔧 Current Field Configuration
pt_br: 🔧 Configuração de Campo Atual

source: Customer Type Field:
pt_br: Campo Tipo de Cliente:

source: Document Field:
pt_br: Campo Documento:

source: Order Storage Mode:
pt_br: Modo de Armazenamento de Pedidos:

source: (High-Performance Order Storage)
pt_br: (Armazenamento de Pedidos de Alto Desempenho)

source: (Legacy Post Storage)
pt_br: (Armazenamento de Posts Legado)

source: Cache cleared, data will be reloaded. Page will refresh automatically...
pt_br: Cache limpo, dados serão recarregados. Página será atualizada automaticamente...

source: Tip:
pt_br: Dica:

source: If data display is incorrect, please click
pt_br: Se a exibição de dados estiver incorreta, clique

source: here to view debug information
pt_br: aqui para ver informações de debug

source: Please check the field name format. Only letters, numbers and underscores are allowed, and must start with a letter or underscore.
pt_br: Verifique o formato do nome do campo. Apenas letras, números e sublinhados são permitidos, e deve começar com uma letra ou sublinhado.

source: Invalid field name format
pt_br: Formato de nome de campo inválido

source: Debug Information
pt_br: Informações de Debug

source: Administrator permissions required to view debug information.
pt_br: Permissões de administrador necessárias para ver informações de debug.

source: WooCommerce Storage Mode Detection:
pt_br: Detecção de Modo de Armazenamento WooCommerce:

source: Detection Process:
pt_br: Processo de Detecção:

source: WC Settings Detection:
pt_br: Detecção de Configurações WC:

source: Database Tables Detection:
pt_br: Detecção de Tabelas do Banco de Dados:

source: table exists:
pt_br: tabela existe:

source: Yes
pt_br: Sim

source: No
pt_br: Não

source: record count:
pt_br: contagem de registros:

source: WC OrderUtil Class:
pt_br: Classe WC OrderUtil:

source: Available
pt_br: Disponível

source: Not Available
pt_br: Não Disponível

source: OrderUtil Detection Result:
pt_br: Resultado da Detecção OrderUtil:

source: HPOS Enabled
pt_br: HPOS Habilitado

source: HPOS Not Enabled
pt_br: HPOS Não Habilitado

source: OrderUtil Detection Error:
pt_br: Erro de Detecção OrderUtil:

source: Final Result: High-Performance Order Storage (HPOS)
pt_br: Resultado Final: Armazenamento de Pedidos de Alto Desempenho (HPOS)

source: Final Result: Legacy Post Storage
pt_br: Resultado Final: Armazenamento de Posts Legado

source: Data stored in:
pt_br: Dados armazenados em:

source: and
pt_br: e

source: tables
pt_br: tabelas

source: Related Fields in HPOS Tables (limited to top 20):
pt_br: Campos Relacionados em Tabelas HPOS (limitado aos 20 principais):

source: Related Fields in PostMeta Table (limited to top 20):
pt_br: Campos Relacionados na Tabela PostMeta (limitado aos 20 principais):

source: Field Name
pt_br: Nome do Campo

source: Record Count
pt_br: Contagem de Registros

source: Unique Orders
pt_br: Pedidos Únicos

source: No related fields found in HPOS tables.
pt_br: Nenhum campo relacionado encontrado nas tabelas HPOS.

source: No related fields found in PostMeta table.
pt_br: Nenhum campo relacionado encontrado na tabela PostMeta.

source: Legacy Data in PostMeta Table (for comparison only):
pt_br: Dados Legados na Tabela PostMeta (apenas para comparação):

source: Note: In HPOS mode, these may be old legacy data.
pt_br: Nota: No modo HPOS, estes podem ser dados legados antigos.

source: Current Plugin Configuration:
pt_br: Configuração Atual do Plugin:

source: Storage Mode:
pt_br: Modo de Armazenamento:

source: High-Performance Order Storage
pt_br: Armazenamento de Pedidos de Alto Desempenho

source: Legacy Post Storage
pt_br: Armazenamento de Posts Legado

source: Debug information loading error:
pt_br: Erro ao carregar informações de debug:

source: Are you sure you want to reset to default configuration?
pt_br: Tem certeza de que deseja redefinir para a configuração padrão?

source: Customer Type Field: _brazil_customer_type
pt_br: Campo Tipo de Cliente: _brazil_customer_type

source: Document Field: _brazil_document
pt_br: Campo Documento: _brazil_document

source: CPF Customer Type Value: pessoa_fisica
pt_br: Valor do Tipo de Cliente CPF: pessoa_fisica

source: CNPJ Customer Type Value: pessoa_juridica
pt_br: Valor do Tipo de Cliente CNPJ: pessoa_juridica

source: This operation will take effect immediately.
pt_br: Esta operação terá efeito imediatamente.

source: Field Name Preview:
pt_br: Visualização do Nome do Campo:

source: Migration field name format is invalid.
pt_br: Formato do nome do campo de migração é inválido.

source: Data migration completed! Successfully migrated %d orders.
pt_br: Migração de dados concluída! %d pedidos migrados com sucesso.

source: %d orders had errors during migration.
pt_br: %d pedidos tiveram erros durante a migração.

source: No data found to migrate.
pt_br: Nenhum dado encontrado para migrar.

source: Error occurred during migration:
pt_br: Erro ocorreu durante a migração:

source: Customer type value migration completed! Total migrated %d orders (CPF: %d, CNPJ: %d).
pt_br: Migração de valor de tipo de cliente concluída! Total de %d pedidos migrados (CPF: %d, CNPJ: %d).

source: Migration Details:
pt_br: Detalhes da Migração:

source: %d orders had errors during migration. Please check error logs for details.
pt_br: %d pedidos tiveram erros durante a migração. Verifique os logs de erro para detalhes.

source: No customer type value data found to migrate. All orders may already be using new customer type values.
pt_br: Nenhum dado de valor de tipo de cliente encontrado para migrar. Todos os pedidos podem já estar usando novos valores de tipo de cliente.

source: CPF customer type value: updated from '%s' to '%s' - %d orders
pt_br: Valor do tipo de cliente CPF: atualizado de '%s' para '%s' - %d pedidos

source: CNPJ customer type value: updated from '%s' to '%s' - %d orders
pt_br: Valor do tipo de cliente CNPJ: atualizado de '%s' para '%s' - %d pedidos

source: Order ID
pt_br: ID do Pedido

source: Customer Type
pt_br: Tipo de Cliente

source: Document Number
pt_br: Número do Documento

source: Order Status
pt_br: Status do Pedido

source: Creation Date
pt_br: Data de Criação

source: Current Field
pt_br: Campo Atual

source: No orders found with Brazil field data.
pt_br: Nenhum pedido encontrado com dados de campo do Brasil.

source: Error loading order data, please try again later.
pt_br: Erro ao carregar dados do pedido, tente novamente mais tarde.

source: Settings saved! Cache cleared, statistics will be recalculated using new customer type values.
pt_br: Configurações salvas! Cache limpo, estatísticas serão recalculadas usando novos valores de tipo de cliente.
